{
    "projects" : [
        {
            "title": "tic-tac-toe",
            "image": "./assets/images/tic-tac-toe.png",
            "url": "https://tic-tac-toe-five-sigma.vercel.app/",
            "git": "https://github.com/t-a-s-h/tic-tac-toe",
            "summary": [
                "This #(tic-tac-toe) game lets you play against the computer. It was my experimentation with the minimax algorithm.",
                "The game was created as a means of experimentation with the minimax algorithm. I wanted to experiment with artificial intelligence and this was my introduction into that concept."
            ],
            "more": {
                "description": [
                    "I developed an interactive #(tic-tac-toe) game that gives users the option to play against human or computer opponent. Through developing this game, I was able to explore the use of artificial intelligence in game development, specifically the minimax algorithm."
                ],
                "achievements": {
                    "minimax algorithm implementation": "Successfully implemented to minimax algorithm with some randomization to create a competitive, but somewhat unpredictable opponent.",
                    "responsive design": "This game utilizes a minimalistic design that ensures a seamless gaming experience on both desktop and mobile devices."
                }
            },
            "technologies": [
                {
                    "name": "JavaScript"
                },
                {
                    "name": "CSS"
                },
                {
                    "name": "HTML"
                },
                {
                    "name": "Node.js"
                }
            ]
        },
        {
            "title": "dominoes",
            "image": "./assets/images/dominoes.png",
            "url": "https://replit.com/@t-a-s-h/dominoes",
            "git": "https://github.com/t-a-s-h/dominoes",
            "summary": ["A basic command line based game of #(dominoes) that I created in C++."],
            "more": {
                "description": [
                    "I developed an interactive command line version of the game of #(dominoes) using C++. This game was a means for me to explore object oriented programming (OOP) concepts and an introduction to coding a fully developed project in C++.", 
                    "This game, displays some of my abilities in OOP."
                ],
                "achievements": {
                    "object oriented programming (OOP)": "Successfully used C++ to implement a game using the computer science paradigm of object oriented programming.",
                    "clean code": "Through using GoogleTest, I was able create my code so that any updates to my project can be a seamless as possible."
                }
            },
            "technologies": [
                {
                    "name": "C++"
                }
            ]
        },
        {
            "title": "hangman",
            "image": "./assets/images/hangman.png",
            "url": "https://hangman-vert.vercel.app/",
            "git": "https://github.com/t-a-s-h/hangman/",
            "summary": [
                "In this #(hangman) game, you can either guess a word or have the computer guess a word."
            ],
            "more": {
                "description": [
                    "I developed a #(hangman) game using React. I was inspired to create this by the #(hangman is a weird game) Youtube video. I enjoyed creating this project in particular because it gave me a chance to utilize regular expressions -- at the time I was really into RegEx and I still think it is useful tool that can be used to create some nice code."
                ],
                "achievements": {
                    "JS framework (React)": "Successfully employed React to create an engaging and user-friendly Hangman game.",
                    "regular expressions": "Implemented regular expressions to enhance user experience, creating the option for for users to interact with an \"intelligent\" computer. "
                }
            },
            "technologies": [
                    {
                        "name": "JavaScript"
                    },
                    {
                        "name": "CSS"
                    },
                    {
                        "name": "Node.js"
                    } , 
                    {
                        "name": "React.js"
                    }
                ]
        }
    ]
}